{
  "navbar": {
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
    "language": "Language"
  },
  "footer": {
    "info": "Information",
    "link1": "About",
    "link2": "Projects",
    "link3": "Certificates",
    "link4": "Experience",
    "link5": "Tech Content",
    "tec": "Technologies"
  },
  "about": {
    "title": "My name is",
    "text1": "I am",
    "text2": "Developer",
    "text3": "I transform ideas into digital experiences! I develop modern websites and applications, with optimized and engaging interfaces."
  },
  "projects": {
    "title": "See some of my projects",
    "link": "See more projects"
  },
  "AllProjects": {
    "title": "All Projects 🚀",
    "back": "Back",
    "select": "Choose technology",
    "all": "All"
  },
  "ProjectCard": {
    "link": "Learn more"
  },
  "Modal": {
    "link": "View project"
  },
  "certificates": {
    "title": "Certificates",
    "subtitle": "Here are some of my certificates from courses and training."
  },
  "experience": {
    "title": "My Journey",
    "subtitle": "See my professional and academic trajectory.",
    "ifsp": {
      "title": "IFSP - Araraquara",
      "text1": "During my years of study at the Instituto Federal de Araraquara, I completed a technical course integrated with high school, which lasted four years. It was during this period that I had my first exposure and learned programming languages, including HTML, CSS, PHP, SQL, JavaScript, AJAX and jQuery.",
      "text2": "This course provided me with a solid foundation of basic and technological knowledge. As part of the completion of my course, I developed a special project. The main objective of this project was to integrate and apply the knowledge acquired throughout my education. I chose to create an initiative focused on the non-profit organization 'Parque Vivo'. In this project, I was able to combine my technical and academic learnings, contributing significantly to a relevant and beneficial cause for the community. This experience not only solidified my knowledge, but also allowed me to witness first-hand the practical possibilities of applying technology to impactful social projects."
    },
    "FISistemas": {
      "title": "FI Sistemas",
      "text1": "As I embark on the journey of my first job as a Fullstack Developer, I realize that every line of code I write is infused with effort, continuous learning, and commitment to excellence. My responsibilities are heavy; they involve the creation of vital institutional websites, the development of crucial systems for file management, and the implementation of platforms that strictly comply with the LGPD.",
      "text2": "This position requires not only refined technical skills in languages ​​such as CodeIgniter, JavaScript, SQL, PHP, HTML5, and CSS, but also a deep operational understanding of the practical issues faced by end users. I am the one who optimizes and keeps websites running smoothly, and I am the one who intervenes when unexpected bugs arise, working diligently to resolve each issue and ensure a perfect user experience."
    },
    "MChiodi": {
      "title": "Creation of MChiodi",
      "text1": "When I started studying React Native, I had no idea how much it would impact my life. With dedication and a passion for development, I created MChiodi — a developer account that now features over 7 published apps, as well as a YouTube channel focused on programming content!",
      "text2": "But the most incredible part of this journey wasn't just building apps — it was the opportunities that came along the way. Through this project, I had the honor of speaking at several schools, sharing my experience and encouraging students to believe in the power of learning and technology."
    },
    "MoveMais": {
      "title": "Move Mais",
      "text1": "At Move Mais, an innovative startup focused on urban mobility solutions, I have the opportunity to work as a Front-End Development Analyst. My main responsibility is to develop and maintain the company's systems, ensuring they are modern, responsive, and aligned with the brand's visual identity.",
      "text2": ""
    }
  },
  "projects": {
    "title": "See some of my projects",
    "link": "See more projects",
    "reactNative": {
      "futuroGarantido": {
        "title": "Guaranteed Future",
        "description": "The 'Guaranteed Future' project is a tool designed to assist students. Developed using React Native, this intuitive and simple application facilitates efficient time management for users, helping them in their academic studies. Available for download on the Google Play Store, 'Futuro Garantido' is a testament to the proactive assistance it provides in the daily lives of students."
      },
      "dualGame": {
        "title": "Games for Two",
        "description": "'Fun for Two' is my first project developed from scratch using React Native. Designed as a lightweight and user-friendly gaming platform, it provides fun games for friends to play together. With a focus on simplicity, the application is available on the Google Play Store, marking my first independent application of my development skills and learnings with React Native."
      },
      "PomodoroPrimeTimer": {
        "title": "Pomodoro Prime Timer",
        "description": "The Pomodoro Prime Timer project was created with the intention of helping people learn and improve their productivity. It is a simple and intuitive application that allows users to set a timer for their tasks, helping them focus and manage their time more efficiently. The project was developed using React Native and is available for download on the Google Play Store."
      },
      "GerenciadorCartoes": {
        "title": "Card Manager",
        "description": "Card Manager is an innovative application designed for efficient personal finance management, now completely offline. It offers instant expense tracking, easy credit and debit card management, and intelligent statistical analysis for financial decision making. Ensuring data security, the application operates 100% offline. Available on the PlayStore, Card Manager is developed using React Native."
      },
      "Bibliotrack": {
        "title": "Bibliotrack",
        "description": "Meet Bibliotrack: Your reading app built on React Native. With it, you can easily manage your personal library, add new books, save inspirational quotes, set reading goals and track your progress, all in one place. Simplify and enhance your reading experience with Bibliotrack."
      },
      "FitForge": {
        "title": "FitForge",
        "description": "FitForge is a fitness app built on React Native. It allows you to easily log your daily workouts, track your water intake, use a built-in timer for high-intensity intervals or rest time between sets, view your workout history to track your progress, export your workout data for analysis or sharing and create custom workout routines. Define which muscles to train each day and let the app guide you through each workout."
      },
      "DailyDone": {
        "title": "DailyDone",
        "description": "DailyDone: organize your tasks without relying on the internet and simplify your routine. Record appointments, mark accomplishments and delete unnecessary tasks, keeping focus on what matters. Access everything in one place, offline and reliably. Gain control and productivity with DailyDone!"
      }
    },
    "React.js": {
      "windows": {
        "title": "Windows Project",
        "description": "This educational project was designed using React.js to explore various language techniques. The goal was to create components that resemble the Windows system using custom code, without relying on ready-made APIs. Each component was designed to enhance understanding and proficiency in React.js, providing a rich learning experience while experimenting with various coding approaches within the framework."
      },
      "ShopSupplements": {
        "title": "Shop Supplements",
        "description": "Shop Supplements is a basic layout for supplement stores, designed to showcase different visual options in a modern, responsive and interactive way. With product carousels, 3D effects and smooth animations, it provides an engaging and professional experience. Created by MChiodi, the design combines usability and strong visual identity, allowing customers to explore and choose the best style for their business."
      },
      "ExpressoDesign": {
        "title": "Expresso Design",
        "description": "Expresso Design is a project developed with React.js to demonstrate the practical application of responsive and interactive design concepts. With a modern and elegant interface, it offers an attractive and engaging user experience. This project is a demonstration of MChiodi's commitment to excellence and innovation, combining technical and creative skills to create high-quality design solutions."
      },
      "FlagCustomizer": {
        "title": "Flag Customizer",
        "description": "Personalize your photos with stylish flag overlays in round or square format, adding custom text and personalized colors. Ideal for campaigns, social media, or any visual content where you want to express your identity or brand."
      },
      "MChiodiTools": {
        "title": "MChiodi Tools",
        "description": "MChiodi Tools is a productivity-focused platform built with React.js that offers a curated collection of free and online utilities for developers. With a clean and responsive interface, users can access essential tools such as CNPJ validators, CPF generators, unit converters, secure password generators, and more — all in one place. Designed to streamline everyday coding tasks, this project reflects MChiodi's mission to deliver practical, fast, and intuitive tools for the tech community."
      },
      "InfraDraw": {
        "title": "InfraDraw",
        "description": "InfraDraw is a client-side diagramming tool built with React.js, designed to simplify the creation of system architecture diagrams and mind maps. It features drag-and-drop blocks, real-time connections, zoom & pan controls, dark/light theme switching, and local autosave — all with a modern UI and smooth animations. Ideal for software architects, developers, and IT teams, InfraDraw empowers users to visually map out complex infrastructures directly in the browser, with no backend or login required."
      },
      "MChiodiNews": {
        "title": "MChiodi News",
        "description": "MChiodi News is a modern, content-driven platform created using React.js to deliver high-quality technical articles, video tutorials, and developer insights in a fast and engaging way. Designed with an emphasis on clean UI, smooth scroll animations, and responsive design, the platform provides an elegant reading experience. It serves as a hub for dev knowledge, combining education, inspiration, and interactivity — reflecting MChiodi's commitment to sharing value with the development community."
      },
      "KnowledgeHub": {
        "title": "KnowledgeHub",
        "description": "KnowledgeHub is a modern digital library built with React.js, Vite, Tailwind CSS, and Framer Motion. It centralizes technical articles and PDF materials on topics such as APIs, Development, GitHub, Artificial Intelligence, Node.js, and Python. With a responsive and fluid interface, it offers free and automated access to high-quality content, organized by category based on the repository's folder structure. The project reflects MChiodi's commitment to democratizing technical knowledge, delivering an intuitive, accessible, and scalable educational experience for developers of all levels."
      },
      "MChiodiFocus": {
        "title": "MChiodi Focus",
        "description": "A modern productivity hub designed especially for developers, combining performance, aesthetics and organization in one place. Developed with React.js and other modern technologies, the application offers essential tools to stay focused and manage time efficiently. Among the main features are a task manager with priority setting, a Pomodoro Timer with animations and history, an integrated YouTube player with lo-fi music by default, as well as goal systems, calendar, weather and exchange rate. The interface is inspired by macOS, with window mode, dock and control buttons, providing a pleasant and familiar visual experience."
      },
      "MoveStore": {
        "title": "Move Store",
        "description": "MoveStore is a SPA (Single Page Application) that simulates a virtual car store, allowing users to browse products, add to cart, apply discount coupons and complete purchases. Developed with React.js, React Router, TypeScript, Styled-components and Axios."
      }
    },
    "Node.js": {
      "QRCodesGenerator": {
        "title": "QR Code Generator for E-commerce",
        "description": "This system, developed with Node.js, allows users to easily create QR Codes for URLs, texts, images and other data, offering several options for customization, such as size, color and format."
      },
      "PodcastsManager": {
        "title": "PodcastsManager",
        "description": "Project developed in Node.js to organize and manage podcasts. Includes Episode Listing, Episode Editing, Episode Deletion and filter by name, with scalability and security"
      },
      "CryptoApi": {
        "title": "CryptoApi",
        "description": "Crypto API is a Node.js REST API that provides real-time data about cryptocurrencies, including prices, market history, currency conversions, and custom alerts. With endpoints for price tracking, favorites, and dollar quotes, the API is ideal for applications that need up-to-date information about the crypto market."
      },
      "TaskManager": {
        "title": "Task Manager",
        "description": "This project is a task management system that allows users to register, list, edit and delete tasks. The system consists of a frontend developed in React.js with Tailwind CSS and a backend using Node.js with Express and Sequelize for communication with the database."
      },
      "URLShortener": {
        "title": "URL Shortener",
        "description": "This project is a complete URL shortener that transforms long links into short and easily shareable versions. Divided into two parts, the system has a robust backend, developed in Node.js with Express, which shortens URLs, automatically generates QR Codes and manages redirection to the original links. On the frontend, I used React, Tailwind CSS and Framer Motion to create a modern, interactive and responsive interface, enriched with dynamic animations."
      }
    },
    "VScodeExtensions": {
      "hydration-reminder": {
        "title": "Hydration Reminder",
        "description": "Hydration Reminder is a Visual Studio Code extension that helps developers stay hydrated during long coding sessions. It sends regular reminders to drink water, promoting healthy habits and increasing productivity."
      },
      "Snake-in-VSCode": {
        "title": "Snake in VSCode",
        "description": "Snake in VSCode is a fun and interactive game that brings the classic snake experience to the Visual Studio Code environment. Developed as an extension, it allows users to play while coding, providing a fun and relaxing break from work."
      }
    }
  },
  "youtubeVideos": {
    "video1": {
      "title": "From Developer to Content Creator",
      "description": "In this video, I share my journey from being a developer to becoming a content creator. I talk about the challenges and lessons I’ve learned along the way and how it helped me grow professionally. If you're thinking about taking this path, this video is for you!"
    },
    "video2": {
      "title": "Lynx: A New Threat to React Native and Flutter?",
      "description": "In this video, we discuss Lynx, a new programming language that promises to revolutionize mobile app development. We'll explore its features, advantages, and how it compares to React Native and Flutter. If you're a developer or interested in tech, don’t miss it!"
    },
    "video3": {
      "title": "You're Not a Real Front-End Dev If You Don't Know These 6 Libraries!",
      "description": "In this video, I present 6 essential libraries that every front-end developer should know. Each one offers amazing features that can simplify and speed up your work. If you want to stand out in the field, make sure to check them out!"
    }
  },
  "YoutubeSection": {
    "title": "Tech Content",
    "text": "Here are some videos and content productions that I publish on my channel and social networks!",
    "link": "See more on the channel →"
  }
}