{
  "navbar": {
    "about": "Sobre",
    "projects": "Projetos",
    "contact": "Contato",
    "language": "Idioma"
  },
  "footer": {
    "info": "Informações",
    "link1": "Sobre",
    "link2": "Projetos",
    "link3": "Certificados",
    "link4": "Experiência",
    "link5": "Conteúdo Tech",
    "tec": "Tecnologias"
  },
  "about": {
    "title": "Meu nome é",
    "text1": "Sou",
    "text2": "Desenvolvedor",
    "text3": "transformo ideias em experiências digitais! Desenvolvo sites e aplicativos modernos, com interfaces otimizadas e envolventes."
  },
  "projects": {
    "title": "Conheça alguns de meus projetos",
    "link": "Ver mais projetos"
  },
  "AllProjects": {
    "title": "Todos os Projetos 🚀",
    "back": "Voltar",
    "select": "Escolha a tecnologia",
    "all": "Todas"
  },
  "ProjectCard": {
    "link": "Saber mais"
  },
  "Modal": {
    "link": "Ver projeto"
  },
  "certificates": {
    "title": "Certificados",
    "subtitle": "Aqui estão alguns dos meus certificados de cursos e treinamentos."
  },
  "experience": {
    "title": "Minha Jornada",
    "subtitle": "Veja minha trajetória profissional e acadêmica.",
    "ifsp": {
      "title": "IFSP - Araraquara",
      "text1": "Durante meus anos de estudo no Instituto Federal de Araraquara, concluí um curso técnico integrado ao ensino médio, que durou quatro anos. Foi durante esse período que tive minha primeira exposição e aprendi linguagens de programação, incluindo HTML, CSS, PHP, SQL, JavaScript, AJAX e jQuery.",
      "text2": "Este curso me proporcionou uma base sólida de conhecimentos básicos e tecnológicos. Como parte da conclusão do meu curso, desenvolvi um projeto especial. O objetivo principal deste projeto era integrar e aplicar os conhecimentos adquiridos ao longo da minha educação. Escolhi criar uma iniciativa voltada para a organização sem fins lucrativos 'Parque Vivo'. Neste projeto, consegui combinar meus aprendizados técnicos e acadêmicos, contribuindo significativamente para uma causa relevante e benéfica para a comunidade. Essa experiência não apenas solidificou meu conhecimento, mas também me permitiu testemunhar em primeira mão as possibilidades práticas de aplicar a tecnologia a projetos sociais impactantes."
    },
    "FISistemas": {
      "title": "FI Sistemas",
      "text1": "Ao embarcar na jornada do meu primeiro emprego como Desenvolvedor Fullstack, percebo que cada linha de código que escrevo está impregnada de esforço, aprendizado contínuo e compromisso com a excelência. Minhas responsabilidades são pesadas; eles envolvem a criação de sites institucionais vitais, o desenvolvimento de sistemas cruciais para o gerenciamento de arquivos e a implementação de plataformas que cumprem rigorosamente a LGPD.",
      "text2": "Esta posição exige não apenas habilidade técnica refinada em linguagens como CodeIgniter, JavaScript, SQL, PHP, HTML5 e CSS, mas também uma compreensão operacional profunda das questões práticas enfrentadas pelos usuários finais. Sou eu quem otimiza e mantém sites funcionando perfeitamente, e sou o interventor quando surgem bugs inesperados, trabalhando diligentemente para resolver cada problema e garantir uma experiência perfeita para o usuário."
    },
    "MChiodi": {
      "title": "Criação de MChiodi",
      "text1": "Quando comecei meus estudos em React Native, não imaginava o impacto que isso teria na minha vida. Com dedicação e paixão pelo desenvolvimento, criei a MChiodi, uma conta de desenvolvedor que hoje conta com mais de 7 apps lançados, além de um canal no YouTube com conteúdos voltados à programação!",
      "text2": "Mas o mais incrível dessa jornada não foi apenas construir aplicativos, e sim as oportunidades que surgiram. Através desse projeto, tive a honra de palestrar em algumas escolas, compartilhando minha experiência e incentivando alunos a acreditarem no poder do aprendizado e da tecnologia."
    },
    "MoveMais": {
      "title": "Move Mais",
      "text1": "Na Move Mais, uma startup inovadora focada em soluções de mobilidade urbana, tenho a oportunidade de atuar como Analista de Desenvolvimento Front-End. Minha principal responsabilidade é desenvolver e manter os sistemas da empresa, garantindo que eles sejam modernos, responsivos e alinhados com a identidade visual da marca.",
      "text2": ""
    }
  },
  "projects": {
    "title": "Conheça alguns de meus projetos",
    "link": "Ver mais projetos",
    "reactNative": {
      "futuroGarantido": {
        "title": "Futuro Garantido",
        "description": "O projeto 'Futuro Garantido' é uma ferramenta projetada para auxiliar estudantes. Desenvolvido usando React Native, este aplicativo intuitivo e simples facilita o gerenciamento eficiente do tempo para os usuários, ajudando-os em seus estudos acadêmicos. Disponível para download no Google Play Store, 'Futuro Garantido' é um testemunho do auxílio proativo no dia a dia dos estudantes."
      },
      "dualGame": {
        "title": "Jogos para Dois",
        "description": "'Diversão em Dupla' é meu primeiro projeto desenvolvido do zero utilizando React Native. Projetado como uma plataforma de jogos leve e amigável, ele proporciona jogos divertidos para amigos jogarem juntos. Com foco na simplicidade, o aplicativo está disponível no Google Play Store, marcando minha primeira aplicação independente das habilidades e aprendizados de desenvolvimento com React Native."
      },
      "PomodoroPrimeTimer": {
        "title": "Pomodoro Prime Timer",
        "description": "O projeto Pomodoro Prime Timer foi criado com a intenção de ajudar as pessoas a aprenderem e melhorarem sua produtividade. É um aplicativo simples e intuitivo que permite aos usuários definir um temporizador para suas tarefas, ajudando-os a se concentrar e gerenciar seu tempo de forma mais eficiente. O projeto foi desenvolvido usando React Native e está disponível para download no Google Play Store."
      },
      "GerenciadorCartoes": {
        "title": "Gerenciador de cartões",
        "description": "Gerenciador de cartões é um aplicativo inovador projetado para gerenciamento eficiente de finanças pessoais, agora totalmente offline. Ele oferece rastreamento instantâneo de gastos, gerenciamento fácil de cartões de crédito e débito e análise estatística inteligente para tomada de decisões financeiras. Garantindo a segurança dos dados, o aplicativo opera 100% offline. Disponível no PlayStore, Card Manager é desenvolvido usando React Native."
      },
      "Bibliotrack": {
        "title": "Bibliotrack",
        "description": "Conheça o Bibliotrack: Seu aplicativo de leitura desenvolvido em React Native. Com ele, você pode gerenciar sua biblioteca pessoal com facilidade, adicionar novos livros, salvar citações inspiradoras, estabelecer metas de leitura e acompanhar seu progresso, tudo em um único lugar. Simplifique e aprimore sua experiência como leitor com o Bibliotrack."
      },
      "FitForge": {
        "title": "FitForge",
        "description": "FitForge é um aplicativo de fitness desenvolvido em React Native. Ele permite que você registre seus treinos diários com facilidade, acompanhe sua ingestão de água, use um timer integrado para intervalos de alta intensidade ou tempo de descanso entre as séries, visualize seu histórico de treinos para acompanhar seu progresso, exporte seus dados de treino para análise ou compartilhamento e crie rotinas de treino personalizadas. Defina quais músculos serão treinados a cada dia e deixe o aplicativo guiá-lo durante cada treino."
      },
      "DailyDone": {
        "title": "DailyDone",
        "description": "DailyDone: organize suas tarefas sem depender de internet e simplifique sua rotina. Registre compromissos, marque realizações e exclua o desnecessário, mantendo foco no que importa. Acesse tudo em um só lugar, offline e de forma confiável. Ganhe controle e produtividade com o DailyDone!"
      }
    },
    "reactJS": {
      "windows": {
        "title": "Projeto Windows",
        "description": "Este projeto educacional foi elaborado usando ReactJS para explorar várias técnicas de linguagem. O objetivo era criar componentes que se assemelhassem ao sistema Windows usando código personalizado, sem depender de APIs prontas. Cada componente foi projetado para aprimorar o entendimento e a proficiência em ReactJS, oferecendo uma rica experiência de aprendizado enquanto se experimenta diversas abordagens de codificação dentro do framework."
      },
      "ShopSupplements": {
        "title": "Shop Supplements",
        "description": "Shop Supplements é um layout base para lojas de suplementos, projetado para demonstrar diferentes opções visuais de forma moderna, responsiva e interativa. Com carrosséis de produtos, efeitos 3D e animações suaves, ele proporciona uma experiência envolvente e profissional. Criado por MChiodi, o design combina usabilidade e identidade visual forte, permitindo que clientes explorem e escolham o melhor estilo para seus negócios."
      },
      "ExpressoDesign": {
        "title": "Expresso Design",
        "description": "Expresso Design é um projeto desenvolvido com ReactJS para demonstrar a aplicação prática de conceitos de design responsivo e interativo. Com uma interface moderna e elegante, ele oferece uma experiência de usuário atraente e envolvente. Este projeto é uma demonstração do compromisso de MChiodi com a excelência e a inovação, combinando habilidades técnicas e criativas para criar soluções de design de alta qualidade."
      },
      "FlagCustomizer": {
        "title": "Flag Customizer",
        "description": "Personalize suas fotos com sobreposições de bandeiras estilosas em formato redondo ou quadrado, adicionando texto e cores personalizados. Ideal para campanhas, redes sociais ou qualquer conteúdo visual que expresse sua identidade ou marca."
      },
      "MChiodiTools": {
        "title": "MChiodi Tools",
        "description": "MChiodi Tools é uma plataforma focada em produtividade, desenvolvida com React.js, que oferece uma coleção curada de utilitários online e gratuitos para desenvolvedores. Com uma interface limpa e responsiva, os usuários têm acesso a ferramentas essenciais como validador de CNPJ, gerador de CPF, conversor de unidades, gerador de senhas seguras e muito mais — tudo em um só lugar. Criado para facilitar tarefas rotineiras do dia a dia de quem programa, este projeto reflete o compromisso de MChiodi em fornecer soluções práticas, rápidas e intuitivas para a comunidade de tecnologia."
      },
      "InfraDraw": {
        "title": "InfraDraw",
        "description": "InfraDraw é uma ferramenta de diagramas 100% client-side desenvolvida com React.js, pensada para simplificar a criação de diagramas de arquitetura de sistemas e mapas mentais. Conta com blocos arrastáveis, conexões em tempo real, controles de zoom e navegação, alternância de tema claro/escuro e salvamento local automático — tudo isso com uma interface moderna e animações suaves. Ideal para arquitetos de software, desenvolvedores e equipes de TI, o InfraDraw permite mapear visualmente infraestruturas complexas direto no navegador, sem necessidade de backend ou login."
      },
      "MChiodiNews": {
        "title": "MChiodi News",
        "description": "MChiodi News é uma plataforma moderna voltada para conteúdo técnico, criada com React.js para oferecer artigos de programação, tutoriais em vídeo e insights para desenvolvedores de forma rápida, envolvente e de alta qualidade. Com ênfase em uma interface limpa, animações suaves ao rolar a página e design responsivo, a plataforma proporciona uma experiência de leitura elegante. Serve como um verdadeiro hub de conhecimento para devs, unindo educação, inspiração e interatividade — refletindo o compromisso de MChiodi em compartilhar valor com a comunidade de desenvolvimento."
      },
      "KnowledgeHub": {
        "title": "KnowledgeHub",
        "description": "KnowledgeHub é uma biblioteca digital moderna desenvolvida com React.js, Vite, Tailwind CSS e Framer Motion. Ela centraliza artigos e materiais técnicos em PDF sobre APIs, Desenvolvimento, GitHub, Inteligência Artificial, Node.js e Python. Com uma interface responsiva e fluida, permite acesso gratuito e automatizado a conteúdos de alta qualidade, organizados por categorias com base na estrutura de pastas do repositório. O projeto reflete o compromisso de MChiodi em democratizar o conhecimento técnico, promovendo uma experiência educacional intuitiva, acessível e escalável para desenvolvedores de todos os níveis."
      },
      "MChiodiFocus": {
        "title": "MChiodi Focus",
        "description": "um hub de produtividade moderno pensado especialmente para desenvolvedores, que combina performance, estética e organização em um só lugar. Desenvolvido com React.js e outras tecnologias modernas, o aplicativo oferece ferramentas essenciais para manter o foco e gerenciar o tempo com eficiência. Entre os principais recursos estão um gerenciador de tarefas com definição de prioridades, um Pomodoro Timer com animações e histórico, um player de YouTube integrado com música lo-fi por padrão, além de sistemas de metas, calendário, clima e câmbio. A interface é inspirada no macOS, com modo janela, dock e botões de controle, proporcionando uma experiência visual agradável e familiar."
      },
      "MoveStore": {
        "title": "Move Store",
        "description": "O MoveStore é uma aplicação SPA (Single Page Application) que simula uma loja de carro virtual, permitindo ao usuário navegar por produtos, adicionar ao carrinho, aplicar cupons de desconto e finalizar a compra. Desenvolvido com React.js, React Router, TypeScript, Styled-components e Axios."
      }
    },
    "NodeJS": {
      "PodcastsManager": {
        "title": "Gerenciador de Podcasts",
        "description": "Projeto desenvolvido em NodeJS para organizar e gerenciar podcasts. Inclui Listagem de Episódios, Edição de Episódios, Exclusão de Episódios e filtro por nome, com escalabilidade e segurança"
      },
      "CryptoApi": {
        "title": "CryptoApi",
        "description": "Crypto API é uma API REST em Node.js que fornece dados em tempo real sobre criptomoedas, incluindo preços, histórico de mercado, conversão de moedas e alertas personalizados. Com endpoints para rastreamento de preços, favoritos e cotação do dólar, a API é ideal para aplicações que necessitam de informações atualizadas sobre o mercado cripto."
      },
      "TaskManager": {
        "title": "Gerenciador de Tarefas",
        "description": "Este projeto é um sistema de gerenciamento de tarefas que permite aos usuários registrar, listar, editar e excluir tarefas. O sistema consiste em um frontend desenvolvido em React.js com Tailwind CSS e um backend usando Node.js com Express e Sequelize para comunicação com o banco de dados."
      },
      "URLShortener": {
        "title": "URL Shortener",
        "description": "Este projeto é um encurtador de URLs completo que transforma links extensos em versões curtas e facilmente compartilháveis. Dividido em duas partes, o sistema conta com um backend robusto, desenvolvido em Node.js com Express, que realiza o encurtamento das URLs, gera QR Codes automaticamente e gerencia o redirecionamento para os links originais. No frontend, utilizei React, Tailwind CSS e Framer Motion para criar uma interface moderna, interativa e responsiva, enriquecida com animações dinâmicas."
      }
    },
    "VScodeExtensions": {
      "hydration-reminder": {
        "title": "Hydration Reminder",
        "description": "O Hydration Reminder é uma extensão do Visual Studio Code que ajuda os desenvolvedores a se manterem hidratados durante longas sessões de codificação. Ele envia lembretes regulares para beber água, promovendo hábitos saudáveis e aumentando a produtividade."
      },
      "Snake-in-VSCode": {
        "title": "Snake in VSCode",
        "description": "O Snake in VSCode é um jogo divertido e interativo que traz a clássica experiência do jogo da cobrinha para o ambiente do Visual Studio Code. Desenvolvido como uma extensão, ele permite que os usuários joguem enquanto codificam, proporcionando uma pausa divertida e relaxante durante o trabalho."
      }
    }
  },
  "youtubeVideos": {
    "video1": {
      "title": "De Programador a Criador de Conteúdo",
      "description": "Neste vídeo, compartilho minha jornada de programador a criador de conteúdo. Falo sobre os desafios e aprendizados que enfrentei ao longo do caminho e como isso me ajudou a crescer profissionalmente. Se você está pensando em seguir esse caminho, este vídeo é para você!"
    },
    "video2": {
      "title": "Lynx: Uma Nova Ameaça ao React Native e Flutter?",
      "description": "Neste vídeo, discutimos o Lynx, uma nova linguagem de programação que promete revolucionar o desenvolvimento de aplicativos móveis. Vamos explorar suas características, vantagens e como ela se compara ao React Native e Flutter. Se você é desenvolvedor ou está interessado em tecnologia, não perca!"
    },
    "video3": {
      "title": "Você Não É Front-End de Verdade se Não Conhece Essas 6 Bibliotecas!",
      "description": "Neste vídeo, apresento 6 bibliotecas essenciais que todo desenvolvedor front-end deve conhecer. Cada uma delas traz funcionalidades incríveis que podem facilitar e agilizar o seu trabalho. Se você quer se destacar na área, não deixe de conferir!"
    }
  },
  "YoutubeSection": {
    "title": "Conteúdo Tech",
    "text": "Aqui estão alguns vídeos e produções de conteúdo que publico no meu canal e redes sociais!",
    "link": "Ver mais no canal →"
  }
}